In [14]:
import pandas as pd
data=[1,2,5,6,9]
s=pd.Series(data,index=['a','b','c','d','e'])
print(s)

a    1
b    2
c    5
d    6
e    9
dtype: int64

In [20]:
data={'a':[1,2,5,7,4],'b':[4,8,7,9,4]}
df=pd.DataFrame(data)
df

   a  b
0  1  4
1  2  8
2  5  7
3  7  9
4  4  4

In [23]:
data1={'a':['apple','banana','mango'],'b':[2,4,5]}
df1=pd.DataFrame(data1)
df1

        a  b
0   apple  2
1  banana  4
2   mango  5

In [91]:
data2={'fruits':['apple','orange','mango'],'count':[12,13,14]}
df3=pd.DataFrame(data2)
df3

   fruits  count
0   apple     12
1  orange     13
2   mango     14

In [92]:
df3.iloc[:,1]
df3

   fruits  count
0   apple     12
1  orange     13
2   mango     14

In [81]:
df3.loc[:,'fruits']

0     apple
1    orange
2     mango
Name: fruits, dtype: object

In [75]:
df3=df3.drop(columns=['fruits'])
df3

   count
0     12
1     13
2     14

In [46]:
data=pd.Series([6,12],index=['a','b'])
df=pd.DataFrame(data)
df.rename(index=str,columns={0:'A'},inplace=True)
colList=[]
df.columns=['a']
for col in df.columns:
    if col=='a':
        col='b'
    colList.append(col)
df.columns=colList
df

    b
a   6
b  12

In [51]:
df=pd.DataFrame({'A':[0,1,5],'B':[2,8,9]})
df

   A  B
0  0  2
1  1  8
2  5  9

In [52]:
df1=pd.DataFrame({'A':[1,2,3],'C':[7,8,10]})
df1

   A   C
0  1   7
1  2   8
2  3  10

In [53]:
pd.concat([df,df1])

   A    B     C
0  0  2.0   NaN
1  1  8.0   NaN
2  5  9.0   NaN
0  1  NaN   7.0
1  2  NaN   8.0
2  3  NaN  10.0

In [60]:
pd.concat([df,df1],axis=1,join='inner')

   A  B  A   C
0  0  2  1   7
1  1  8  2   8
2  5  9  3  10

In [67]:
print(df)
print(df1)
pd.merge(df,df1,on=['A'],how='inner')

   A  B
0  0  2
1  1  8
2  5  9
   A   C
0  1   7
1  2   8
2  3  10

   A  B  C
0  1  8  7

In [63]:
pd.merge(df,df1,on=['A'],how='inner')

   A  B  C
0  1  8  7

In [64]:
pd.merge(df,df1,on=['A'],how='left')

   A  B    C
0  0  2  NaN
1  1  8  7.0
2  5  9  NaN

In [65]:
pd.merge(df,df1,on=['A'],how='right')

   A    B   C
0  1  8.0   7
1  2  NaN   8
2  3  NaN  10